Revit 2027 API
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands Class
 A collection of command ids used in manage links.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class BuiltInExternalDataManagerCommands
Public NotInheritable Class BuiltInExternalDataManagerCommands
public ref class BuiltInExternalDataManagerCommands abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BuiltInExternalDataManagerCommands = class end
The ExternalDataManagerCommands.BuiltInExternalDataManagerCommands type exposes the following members.
Properties
Name | Description
Add |  Add new external data.
Import |  Import external data into Revit model.
ManageWorksets |  Manage workset for external data.
PlaceInstance |  Place a external data into Revit model.
Reload |  Remove external data.
ReloadFrom |  Reload external data from specified location.
Remove |  Unload external data.
Show |  Show a external data in canvas.
Unload |  Unload external data.
Top
Remarks
 This namespace declares the set of command identifiers that are always available in Revit ("built-in" commands). Each value corresponds to an entry in the Manage Links dialog or its context menus. The GUID values are consumed by: ExternalDataManagerCommand - Stores metadata such as localized names/tool-tips for each id. ExternalDataManagerTool - References the ids to build content tools or right-click menu structures. IExternalDataManagerServer.onCommand - Receives the id to execute the appropriate action on the selected data rows. Plugin authors should reference these constants rather than inventing their own when they want to reuse existing Revit UI actions (e.g. "Reload" or "Unload"). Custom commands, on the other hand, must be registered with a unique id obtained from 'ExternalDataManagerCommandId'.
See Also
Reference
Autodesk.Revit.UI Namespace